/*
Определите класс Histogram, который хранит числа из
интервалов, указанных аргументами конструктора.
Напишите функции для вывода гистограмм. Обрабатывайте
ошибки выхода из диапазона значений.
*/

#include <iostream>
#include "histogram.h"

int main() {
	Histogram a(0, 10);
	a.add(3) + 4 + 5 + 6;
	std:: cout << a << std::endl;
	return 0;
}